export var zh_CN = {
    CN: {
        property: {
            side: {
                title: "权限管理",
                menu: {
                    role: "角色管理",
                    user: "用户管理",
                    org: "组织结构"
                }
            }
        },
        region:{
            "gz":"广州",
            "sh":"上海",
            "shjr":"上海金融",
            "bj":"北京",
            "hk":"香港",
            "sg":"新加坡",
            "ca":"多伦多"
        },
        action: {
            "create": "新建",
            "boot":"开机",
            "edit": "编辑",
            "del": "删除",
            "shutdown": "关机",
            "reboot": "重启",
            "repass":"重置密码",
            "moreOps":"更多操作",
            "addKeypair":"加载密钥",
            "allocateToPro":"分配至项目",
            "rename":"改名",
            "changeNet":"调整网络",
            "destory":"销毁",
            "expChk":"导出选中",
            "expAll":"导出全部",
            "search":"搜索"
        },
        "overview":{
            "quota":{
                "image":"镜像",
                "snap":"快照",
                "prepay":"云服务器(包年包月)",
                "quoties":"云服务器(按量计费)"
            },
            "region":{
                "1":"广州",
                "4":"上海",
                "5":"香港",
                "6":"北美",
                "7":"上海金融",
                "8":"北京"
            }
        },
        "instances":{
            "table":{
                "cvmPayMode":{
                    "0":"按月结算的后付费",
                    "1":"包年包月",
                    "2":"按量计费"
                },
                "networkPayMode":{
                    "0":"按月结算的后付费",
                    "1":"包年包月",
                    "2":"按流量",
                    "3":"按带宽"
                },
                "rootType":{
                    "1":"本地盘", 
                    "2":"云硬盘", 
                    "3":"SSD本地盘", 
                    "4":"SSD云盘"
                },
                "isVpcGateway":{
                    "0":"否",
                    "1":"是"
                },
                "region":{
                    "bj":"北京",
                    "sh":"上海",
                    "gz":"广州",
                    "ca":"北美",
                    "hk":"香港",
                    "szjr":"深圳金融",
                    "shjr":"上海金融",
                    "gzopen":"广州open",
                    "sg":"新加坡"
                },
                "status":{
                    "1":"故障",
                    "2":"运行中",
                    "3":"创建中",
                    "4":"已关机",
                    "5":"已退还",
                    "6":"退还中",
                    "7":"重启中",
                    "8":"开机中",
                    "9":"关机中",
                    "10":"密码重置中",
                    "11":"格式化中",
                    "12":"镜像制作中",
                    "13":"带宽设置中",
                    "14":"重装系统中",
                    "15":"域名绑定中",
                    "16":"域名解绑中",
                    "17":"负载均衡绑定中",
                    "18":"负载均衡解绑中",
                    "19":"升级中",
                    "20":"秘钥下发中",
                    "21":"维护中",
                    "28":"回收中"
                }
            }
        },
        "images":{
            "table":{
                "status":{
                    "1":"创建中",
                    "2":"正常",
                    "3":"使用中",
                    "4":"同步中",
                    "5":"复制中"
                },
                "imageType":{
                    "1":"私有镜像",
                    "2":"公共镜像",
                    "3":"服务市场",
                    "4":"共享镜像"
                }
            }
        },
        "sshkey":{
            "table":{
                "status":{
                    "0":"正常",
                    "1":"非正常"
                }
            }
        },
        "securitygroup":{
            "table":{
                "action":{
                    "ACCEPT":"接受",
                    "DROP":"拒绝"
                }
            }
        },
        "eip":{
            "table":{
                "status":{
                    "0":"创建中",
                    "1":"绑定中",
                    "2":"已绑定", 
                    "3":"解绑中", 
                    "4":"未绑定", 
                    "6":"下线中", 
                    "9":"创建失败"
                },
                "type":{
                    "0":"云服务器",
                    "1":"NAT网关"
                }
            }
        },
        "cbs":{
            "region":{
                    "bj":"北京",
                    "sh":"上海",
                    "gz":"广州",
                    "ca":"北美",
                    "hk":"香港",
                    "szjr":"深圳金融",
                    "shjr":"上海金融",
                    "gzopen":"广州open",
                    "sg":"新加坡"
                },
            "table":{
                "zone":{
                    "800001":"北京一区",
                    "800002":"北京二区",
                    "100001":"广州一区",
                    "100002":"广州二区",
                    "100003":"广州三区",
                    "200001":"上海一区",
                    "300001":"香港一区",
                    "400001":"多伦多一区",
                    "900001":"新加坡一区"
                },
                "diskType":{
                    "data":"数据盘",
                    "root":"系统盘"
                },
                "storageType":{
                    "cloudBasic":"云硬盘",
                    "cloudSSD":"SSD云硬盘"
                },
                "payMode":{
                    "prePay":"包年包月",
                    "postPay":"按量计费"
                },
                "storageStatus":{
                    "attached":"已挂载",
                    "detached":"待挂载",
                    "toRecycle":"待销毁",
                    "attaching":"挂载中",
                    "detaching":"解挂中",
                    "snapshotCreating":"快照创建中",
                    "rollback":"回滚中",
                    "rollbacking":"回滚中",
                    "expanding":"扩容中",
                    "normal":"假的正常"
                },
                "portable":{
                    0:"不支持",
                    1:"支持"
                }
            },
            "snap":{
                "snapshotStatus":{
                    "normal":"正常",
                    "creating":"创建中",
                    "rollbacking":"回滚中"
            },
                "diskType":{
                    "data":"数据盘",
                    "root":"系统盘"
                }
            }
        },
        "redis":{
            "taskStatus":{
                "0":"待执行",
                "1":"执行中",
                "2":"成功",
                "3":"失败",
                "-1":"执行出错"
            },
            "taskType":{
                "importRdb":"导入Rdb",
                "exportBackup":"导出备份",
                "restoreBackup":"恢复实例",
                "restoreStream":"回档实例",
                "backupInstance":"备份实例",
                "cleanInstance":"清空实例",
                "resizeInstance":"升级实例",
                "setPassword":"设置密码",
                "deleteInstance":"删除实例",
                "newInstance":"新建实例",
                "closeInstance":"隔离实例",
                "startInstance":"解隔离实例"
            }
        },
        "mysql":{
            cdbWanStatus:{//外网访问状态，可能返回值：
                0:"未开",
                1:"已开通",
                2:"已关闭",
                3:"处理中"
            },
            taskStatus:{//实例任务状态，可能返回值：
                0:"--",
                1:"升级中",
                2:"数据导入中",
                3:"开放Slave中",
                4:"外网访问开通中",
                5:"批量操作执行中",
                6:"回档中",
                7:"外网访问关闭中",
                8:"密码修改中",
                9:"实例名修改中",
                10:"重启中",
                12:"自建迁移中",
                13:"删除库表中",
                14:"灾备实例创建同步中"
            },
            taskTypeList:{
                //1:"数据库回档",
                2:"批量SQL操作",
                3:"数据导入",
                5:"参数设置",
                6:"初始化",
                7:"重启",
                8:"开启GTID",
                9:"只读实例升级",
                10:"数据库回档",
                11:"主实例升级",
                12:"删除库表",
                13:"切换为主实例"
            },
            taskStatusList:{
                0:"运行中",
                1:"运行中",
                2:"执行成功",
                3:"执行失败",
                4:"已终止",
                5:"已删除",
                6:"正在终止"
            },
            vpcId:{
                0:"基础网络"
            },
            cdbType:{
                CUSTOM:"高IO版"
            },
            status:{//实例状态，可能返回值：
                0:"创建中",
                1:"运行中",
                4:"删除中",
                5:"隔离中",
                101:"锁定中"
            },
            initFlag:{
                0:"未初始化",
                1:"已初始化"
            },
            cdbInstanceType:{//实例类型，可能返回值：
                1:"主实例",
                2:"灾备实例",
                3:"只读实例"
            },
            payType:{//实例计费类型
                0:"包年包月",
                1:"按量计费",
                2:"后付费月结"
            },
            zoneId:{
                100002:"广州二区",
                100003:"广州三区",
                100004:"广州四区",
                200001:"上海一区",
                200002:"上海二区",
                200003:"上海三区",
                200800:"上海四区",
                700001:"上海金融一区",
                800001:"北京一区",
                800002:"北京二区",
                800003:"北京三区",
                300001:"香港一区",
                900001:"新加坡一区",
                400001:"多伦多一区"
            }
        },
        "vpc":{
            "natState":{
                "0":"运行中",
                "1":"不可用",
                "2":"欠费停服"
            },
            "natProductionStatus":{
                "0":"创建中",
                "1":"创建成功",
                "2":"创建失败",
                "3":"变更中",
                "4":"变更失败",
                "5":"删除中",
                "6":"删除失败"
            },
            "maxConcurrent":{
                "1000000":"小型(最大并发连接数100W)",
                "3000000":"中型(最大并发连接数300W)",
                "10000000":"大型(最大并发连接数1000W)"
            },
            "region":{
                "bj":"华北地区(北京)",
                "gz":"华南地区(广州)",
                "sh":"华东地区(上海)",
                "hk":"东南亚地区(香港)",
                "ca":"北美地区(多伦多)"
            },
            "zoneId":{
                100002:"广州二区",
                100003:"广州三区",
                200001:"上海一区",
                700001:"上海金融一区",
                800001:"北京一区",
                300001:"香港一区",
                900001:"新加坡一区",
                400001:"多伦多一区"
            },
            "routeTableType":{
                "0":"自定义表",
                "1":"默认路由表"
            },
            "nextType":{
                "0":"公共网关",
                "1":"VPN网关",
                "2":"Local",
                "3":"专线网关",
                "4":"对等连接",
                "7":"SSLVPN网关",
                "8":"NAT网关"
            }
        },
        "errors":{
            "required": "*必填项",
            "integer": "请输入正整数",
            "atleast": "请输入大于等于1的正整数",
            "maxinteger": "请输入小于100的正整数",
            "integerAndZero": "请输入0或者正整数",
            "noRepeatDepName": "该部门名称已经被占用，请重新输入",
            "maxlength": "请至多输入32位",
            "maxlength20": "请至多输入20位",
            "maxlength255": "请至多输入255位",
            "maxlength256": "请至多输入256位",
            "maxlength128": "请至多输入128位",
            "maxlength100": "请至多输入100位",
            "minlength": "请至少输入8位",
            "maxlengthMid": "请至多输入100位",
            "sizelimit": "请输入1~100000的数,小数需保留两位",
            "maxlengthbig": "请至多输入",
            "minlengthsmall": "请至少输入",
            "lenghtUnit": "位",
            "noSpecial": "只能输入字母、数字、汉字、横线以及下划线",
            "noZhSpecial": "只能输入字母、数字、横线以及下划线",
            "noZhLineSpecial": "只支持英文大小写、数字和下划线",
            "lspecial":"linux机器密码需8到16位，至少包括两项（[a-z,A-Z],[0-9]和[()`~!@#$%^&*-+=_|{}[]:;'<>,.?/]的特殊符号）",
            "wspecial":"windows机器密码需12到16位，至少包括三项（[a-z,A-Z],[0-9]和[()`~!@#$%^&*-+=_|{}[]:;'<>,.?/]的特殊符号）",
            "nameLimit": "只能输入字母、数字、汉字、横线、下划线以及.",
            "toInput": "请输入",
            "toNum": "的正整数",
            "limit_1000": "请输入小于或等于1000的值",
            "pswdNotEqual": "两次输入的密码不同",
            "phone": "请输入正确的手机号",
            "email": "请输入正确的邮箱",
            "min_max": "数值应在{{min}}~{{max}}之间"
        }
    }
};
